<?php
/**
 * Created by PhpStorm.
 * User: lukomsky
 * Date: 27.11.17
 * Time: 21:23
 */
?>

<h3>ТЕСТОВОЕ ЗАДАНИЕ ДЛЯ PHP:</h3>
<p>Без использования фреймворков, написать бекенд хостинга картинок,</p>
<p>в который можно загрузить 1-5 изображение за раз.</p>
<p>Для каждого изображения должна создаваться превью (100х100px).</p>
<p>Генерация превью должна осуществляться в очереди.</p>
<p>После того, как превью сгенерировано, фронтенд может присылать запросы</p>
<p>на изменения тайтла и описания картинки (мета-информация), а также на ее удаление.</p>